NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2018 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_ctsu_qe.c
* Description  : This file implements the QE CTSU API
***********************************************************************************************************************/
/***********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 04.10.2018 1.00    First Release
*              : 09.07.2019 1.10    Added QE_ERR_ABNORMAL_TSCAP, QE_ERR_SENSOR_OVERFLOW, and QE_ERR_SENSOR_SATURATION
*                                     return codes to Open() (error detected during correction)
*                                   Modified to allow R_CTSU_StartScan() to be called in external trigger mode IF
*                                     Touch is performing offset tuning.
*                                   Set ctsu state to RUN (ctsu now busy) in ctsu_ctsuwr_isr() so Touch can detect
*                                     if it missed processing a scan when using external triggers.
*                                   Added Control() commands CTSU_CMD_GET_METHOD_MODE and CTSU_CMD_GET_SCAN_INFO.
*                                   Added 128us delay after setting CTSUPON in init_method().
*                                   Added #pragma sections and ported to GCC/IAR.
*              : 09.01.2020 1.11    Fixed bug where custom callback function was called twice.
*                                     Removed call from ctsu_ctsufn_isr().
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "r_ctsu_qe_if.h"
#include "r_ctsu_qe_private.h"
#include "qe_common.h"
#include "r_dtc.h"
#include "r_ctsu_qe_pinset.h"


/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
External functions
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
ctsu_ctrl_t g_ctsu_ctrl = { .lock = 0,
                            .open = false,
                            .p_callback = NULL
                          };
ctsu_cfg_t *gp_cur_cfg;                             // ptr to current configuration/method
volatile scan_info_t g_pvt_scan_info[QE_NUM_METHODS];

static void init_method(uint8_t method);


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_Open
* Description  : This function initializes the CTSU peripheral, and makes the first configuration in the array passed in
*                the active configuration.
* Arguments    : p_ctsu_cfgs
*                    Pointer to array of scan configurations (must be global) generated by QE Tool
*                num_methods
*                    Number of methods in p_method array
*                trigger
*                    Specifies trigger source to start scan
* Return Value : QE_SUCCESS -
*                    API initialized successfully.
*                QE_ERR_NULL_PTR
*                    Missing argument pointer
*                QE_ERR_INVALID_ARG
*                    "num_methods" or "trigger" is invalid for configuration
*                QE_ERR_BUSY
*                    Cannot run function because another operation is in progress.
*                QE_ERR_ALREADY_OPEN -
*                    Open() called without an intermediate call to Close().
*                QE_ERR_ABNORMAL_TSCAP
*                   TSCAP error detected during correction
*                QE_ERR_SENSOR_OVERFLOW
*                   Sensor overflow error detected during correction
*                QE_ERR_SENSOR_SATURATION -
*                   Initial sensor value beyond linear portion of correction curve
*                QE_ERR_UNSUPPORTED_CLK_CFG -
*                   Unsupported clock speed. Cannot perform CTSU correction.
***********************************************************************************************************************/
qe_err_t R_CTSU_Open(ctsu_cfg_t *p_ctsu_cfgs[], uint8_t num_methods, qe_trig_t trigger)
{
    qe_err_t err = QE_SUCCESS;

#if (CTSU_CFG_PARAM_CHECKING_ENABLE)
    if (NULL == p_ctsu_cfgs)
    {
        return QE_ERR_NULL_PTR;
    }

    if ((num_methods > QE_NUM_METHODS)
     || (trigger >= QE_TRIG_END_ENUM)
     || ((QE_TRIG_EXTERNAL == trigger) && (CTSU_CFG_USE_DTC == 1)))
    {
        return QE_ERR_INVALID_ARG;
    }

    /* NOTE: Do not verify configuration content. Should be generated by QE Tool and be bug-free. */
#endif

    /* Check if another API call is in progress */
    if (R_BSP_SoftwareLock(&g_ctsu_ctrl.lock) == false)
    {
        return QE_ERR_BUSY;
    }

    /* See if driver is already open (must Close() before doing an Open() on a another configuration) */
    if (true == g_ctsu_ctrl.open)
    {
        R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);
        return QE_ERR_ALREADY_OPEN;
    }

