NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    /* Get CTSU out of stop state (supply power/clock) */
    R_BSP_RegisterProtectDisable (BSP_REG_PROTECT_LPC_CGC_SWR);
    MSTP(CTSU) = 0;
    R_BSP_RegisterProtectEnable (BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Initialize driver control structure */
    g_ctsu_ctrl.p_methods = p_ctsu_cfgs;                  // NOTE: points to global created by QE tool
    g_ctsu_ctrl.num_methods = num_methods;
    g_ctsu_ctrl.rd_index = 0;
    g_ctsu_ctrl.wr_index = 0;
    g_ctsu_ctrl.trigger = trigger;

    /* Enable interrupts for write, read, & scan done */
    IR(CTSU,CTSUWR)= 0;
    IR(CTSU,CTSURD)= 0;
    IR(CTSU,CTSUFN)= 0;
    IPR(CTSU,CTSUWR)= CTSU_CFG_INT_PRIORITY_LEVEL;
    IPR(CTSU,CTSURD)= CTSU_CFG_INT_PRIORITY_LEVEL;
    IPR(CTSU,CTSUFN)= CTSU_CFG_INT_PRIORITY_LEVEL;
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
    IEN(CTSU,CTSUWR)= 1;
    IEN(CTSU,CTSURD)= 1;
    IEN(CTSU,CTSUFN)= 1;
#else
    R_BSP_InterruptRequestEnable(VECT(CTSU,CTSUWR));
    R_BSP_InterruptRequestEnable(VECT(CTSU,CTSURD));
    R_BSP_InterruptRequestEnable(VECT(CTSU,CTSUFN));
#endif

    /* Set current configuration to the first method.
     * The correction method needs it to find the first active channel to calculate gain with.
     * It also uses its scan buffer for interrupts instead of having a temporary buffer.
     * None of method 0's configuration values are altered.
     */
    gp_cur_cfg = p_ctsu_cfgs[0];

    /* Discharge (make GPIO output) and charge (configure for TSCAP) TSCAP pin */
    R_Set_CTSU_TSCAP_Discharge();
    R_BSP_SoftwareDelay(30,BSP_DELAY_MICROSECS);
    R_Set_CTSU_TSCAP_Charge();
    R_BSP_SoftwareDelay(500, BSP_DELAY_MICROSECS);

    /* Perform sensor gain correction */
    err = correction_CTSU_sensor_ico();
    if (QE_SUCCESS != err)
    {
        R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);
        R_CTSU_Close();
    }
    else
    {
        /* Initialize driver registers to first method (default) */
        init_method(0);

        /* Initialize DTC */
#if (CTSU_CFG_USE_DTC == 1)
        dtc_ctsu_init();
#endif
        /* Do not set up for external triggers here even if configured.
         * 1) Would be changed immediately to SW trigger by Touch for offset tuning.
         * 2) If ext trig was set up before Open, which it shouldn't, a scan may occur before
         *    Touch Open() is complete.
         */

        /* Mark driver as open */
        g_ctsu_ctrl.open = true;
        R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);
    }

    return err;

} /* End of function R_CTSU_Open() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: init_method
* Description  : This functions initializes the registers for the method configuration provided.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
static void init_method(uint8_t method)
{
    ctsu_cfg_t *p_scan_cfg = g_ctsu_ctrl.p_methods[method];


    /* Save method number */
    g_ctsu_ctrl.cur_method = method;

    /* Write CTSU Control Register 1 and save mode */
    CTSU.CTSUCR1.BYTE = p_scan_cfg->ctsucr1;        // MD, CLK, ATUNE1, ATUNE0, CSW, PON
    while (1 != CTSU.CTSUCR1.BIT.CTSUPON)           /* Wait for charging to stabilize */
    {
        ;
    }
    R_BSP_SoftwareDelay(128, BSP_DELAY_MICROSECS);

    /* get enum equivalent of mode */
    g_ctsu_ctrl.mode = (ctsu_mode_t) CTSU.CTSUCR1.BIT.CTSUMD;


    /* Set static registers */
    CTSU.CTSUSDPRS.BYTE = p_scan_cfg->ctsusdprs;    // Synchronous Noise Reduction Setting
    CTSU.CTSUSST.BYTE = 0x10;                       // Sensor Stabilization- ALWAYS 0x10 as per HW Manual
    CTSU.CTSUDCLKC.BYTE = 0x30;                     // High Pass Noise Reduction- ALWAYS 0x30 as per HW Manual

    CTSU.CTSUCHAC0.BYTE = p_scan_cfg->ctsuchac0;    // Channel Enable Control: TS0-TS7
    CTSU.CTSUCHAC1.BYTE = p_scan_cfg->ctsuchac1;    // Channel Enable Control: TS8-TS15
#if (CTSU_HAS_LARGE_REG_SET)
    CTSU.CTSUCHAC2.BYTE = p_scan_cfg->ctsuchac2;    // Channel Enable Control: TS16-TS23
    CTSU.CTSUCHAC3.BYTE = p_scan_cfg->ctsuchac3;    // Channel Enable Control: TS24-TS31
    CTSU.CTSUCHAC4.BYTE = p_scan_cfg->ctsuchac4;    // Channel Enable Control: TS32-TS35
#endif

    if (CTSU_MODE_SELF_SINGLE_SCAN == g_ctsu_ctrl.mode)
    {
        CTSU.CTSUMCH0.BYTE = p_scan_cfg->p_elem_ch[0].rx_chan;    // Only sensor to scan
    }

    if (CTSU_MODE_MUTUAL_FULL_SCAN == g_ctsu_ctrl.mode)
    {
        CTSU.CTSUCHTRC0.BYTE = p_scan_cfg->ctsuchtrc0;  // Channel Transmit Control: TS0-TS7
        CTSU.CTSUCHTRC1.BYTE = p_scan_cfg->ctsuchtrc1;  // Channel Transmit Control: TS8-TS15
#if (CTSU_HAS_LARGE_REG_SET)
        CTSU.CTSUCHTRC2.BYTE = p_scan_cfg->ctsuchtrc2;  // Channel Transmit Control: TS16-TS23
        CTSU.CTSUCHTRC3.BYTE = p_scan_cfg->ctsuchtrc3;  // Channel Transmit Control: TS24-TS31
        CTSU.CTSUCHTRC4.BYTE = p_scan_cfg->ctsuchtrc4;  // Channel Transmit Control: TS32-TS35
#endif
    }

#if (CTSU_HAS_TXVSEL)
    CTSU.CTSUCR0.BIT.CTSUTXVSEL = p_scan_cfg->txvsel;
#endif

    /* Initialize CTSU hardware control block */
    CTSU.CTSUCR0.BIT.CTSUINIT = 1;

    /* Set global pointer to this configuration */
    gp_cur_cfg = p_scan_cfg;
    return;

} /* End of function init_method() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_StartScan
* Description  : This functions starts the scan for the configured sensors. This function should only be called AFTER
*                correction completes (this function has possible DTC use, will not run when external triggers are
*                configured, and the lock is already set from Open() ).
* Arguments    : None
* Return Value : QE_SUCCESS
*                    Scan started
*                QE_ERR_TRIGGER_TYPE
*                    Function should not be called to start scans when using external triggers
*                QE_ERR_BUSY
*                    Cannot run function because another operation is in progress.
***********************************************************************************************************************/
qe_err_t R_CTSU_StartScan(void)
{

    /* Return error if in external trigger mode and Touch is not doing offset tuning */
    if ((QE_TRIG_EXTERNAL == g_ctsu_ctrl.trigger) && (0 == gp_cur_cfg->ctsu_status.flag.offset_tuning))
    {
        return QE_ERR_TRIGGER_TYPE;
    }

    /* Check if another API call is in progress */
    if ((R_BSP_SoftwareLock(&g_ctsu_ctrl.lock) == false)
     && (false == g_correction_mode))
    {
        return QE_ERR_BUSY;
    }

    g_ctsu_ctrl.state = CTSU_STATE_RUN;

    /* Setup addresses for DTC interrupt transfers */
#if (CTSU_CFG_USE_DTC == 1)

    /* cast pointers to absolute addresses */
    dtc_ctsu_xfer_addrs((uint32_t)gp_cur_cfg->p_elem_regs, (uint32_t)gp_cur_cfg->p_scan_buf);
#endif

    /* Start scan */
    CTSU.CTSUCR0.BIT.CTSUSTRT = 1;

    /* (operation unlocked at interrupt level) */

    return QE_SUCCESS;

