NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
} /* End of function R_CTSU_StartScan() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: ctsu_ctsuwr_isr
* Description  : CTSU WR interrupt handler. This service routine sets the tuning for the next element to be scanned by
*                hardware.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
#pragma interrupt (ctsu_ctsuwr_isr(vect=VECT(CTSU,CTSUWR)))
static void ctsu_ctsuwr_isr(void)
#else
R_BSP_PRAGMA_STATIC_INTERRUPT(ctsu_ctsuwr_isr, VECT(CTSU,CTSUWR))
R_BSP_ATTRIB_STATIC_INTERRUPT void ctsu_ctsuwr_isr(void)
#endif
{
    uint8_t     i;

    if (true == g_correction_mode)  // _1_CORRECTION
    {
        /* 32 scans, txd[2] modified, then 32 scans */
        CTSU.CTSUSSC.WORD = g_correction_dtc_txd[0];
        CTSU.CTSUSO0.WORD = g_correction_dtc_txd[1];
        CTSU.CTSUSO1.WORD = g_correction_dtc_txd[2];
    }
    else /* _0_NORMAL */
    {
        /* In case using external trigger, set state to RUN so Touch knows buffer being updated.
         * NOTE: dtc does not work with ext trigger, so this interrupt will occur.
         */
        g_ctsu_ctrl.state = CTSU_STATE_RUN;

        /* get current channel index and write settings for current element */
        i = g_ctsu_ctrl.wr_index++;
        CTSU.CTSUSSC.WORD = gp_cur_cfg->p_elem_regs[i].ctsussc;
        CTSU.CTSUSO0.WORD = gp_cur_cfg->p_elem_regs[i].ctsuso0;
        CTSU.CTSUSO1.WORD = gp_cur_cfg->p_elem_regs[i].ctsuso1;
    }

} /* End of function ctsu_ctsuwr_isr() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: ctsu_ctsurd_isr
* Description  : CTSU RD interrupt handler. This service routine reads the sensor count and reference counter for
*                the current element and places the value in the scan data buffer. Note that the reference counter
*                does not work properly but is saved anyway for backward compatibility and potential future use.
*                Additionally, the SC register cannot be read again until RC is read.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
#pragma interrupt (ctsu_ctsurd_isr(vect=VECT(CTSU,CTSURD)))
static void ctsu_ctsurd_isr(void)
#else
R_BSP_PRAGMA_STATIC_INTERRUPT(ctsu_ctsurd_isr, VECT(CTSU,CTSURD))
R_BSP_ATTRIB_STATIC_INTERRUPT void ctsu_ctsurd_isr(void)
#endif
{
    /* read current channel/element value */
    gp_cur_cfg->p_scan_buf[g_ctsu_ctrl.rd_index++] = CTSU.CTSUSC.WORD;

    /* Store the reference counter for possible future use. Register must be read or scan will hang. */
    gp_cur_cfg->p_scan_buf[g_ctsu_ctrl.rd_index++] = CTSU.CTSURC.WORD;

} /* End of function ctsu_ctsurd_isr() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: ctsu_ctsufn_isr
* Description  : CTSU FN interrupt handler. This service routine occurs when all elements have been scanned (finished).
*                The user's callback function is called if available.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
#pragma interrupt (ctsu_ctsufn_isr(vect=VECT(CTSU,CTSUFN)))
static void ctsu_ctsufn_isr(void)
#else
R_BSP_PRAGMA_STATIC_INTERRUPT(ctsu_ctsufn_isr, VECT(CTSU,CTSUFN))
R_BSP_ATTRIB_STATIC_INTERRUPT void ctsu_ctsufn_isr(void)
#endif
{

    /* Call main interrupt handler (primarily for correction) */
    CTSUInterrupt();

    /* reset indexes */
    g_ctsu_ctrl.wr_index = 0;
    g_ctsu_ctrl.rd_index = 0;

    /* mark CTSU as no longer busy */
    R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);

} /* End of function ctsu_ctsufn_isr() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_ReadButton
* Description  : This function gets the scan data associated with the specified button.
* Arguments    : p_btn_ctrl
*                    Pointer to configuration for button to read.
*                p_value1
*                    Pointer to load primary button value
*                p_value2
*                    Pointer to load secondary button value in mutual mode only. Can be NULL in other modes.
* Return Value : QE_SUCCESS
*                    Button data read.
*                QE_ERR_NULL_PTR
*                    Missing argument pointer.
*                QE_ERR_INVALID_ARG
*                    Unrecognized element id
*                QE_ERR_BUSY
*                    Cannot run function because another operation is in progress.
***********************************************************************************************************************/
qe_err_t R_CTSU_ReadButton(btn_ctrl_t *p_btn_ctrl, uint16_t *p_value1, uint16_t *p_value2)
{
    qe_err_t err = QE_SUCCESS;

#if (CTSU_CFG_PARAM_CHECKING_ENABLE)
    if ((NULL == p_btn_ctrl)
     || (NULL == p_value1)
     || ((NULL == p_value2) && (CTSU_MODE_MUTUAL_FULL_SCAN == g_ctsu_ctrl.mode)))
    {
        return QE_ERR_NULL_PTR;
    }
#endif

    /* Load value(s) from scan buffer */
    err = R_CTSU_ReadElement(p_btn_ctrl->elem_index, p_value1, p_value2);

