NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    return err;

} /* End of function R_CTSU_ReadButton() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_ReadSlider
* Description  : This function gets the scan data associated with the specified slider/wheel.
* Arguments    : p_sldr_ctrl
*                    Pointer to configuration for slider/wheel to read.
*                p_buf1
*                    Pointer to array to load primary values
*                p_buf2
*                    Pointer to array to load secondary values in mutual mode only. Can be NULL in other modes.
*
* Return Value : QE_SUCCESS
*                    Slider/wheel data read.
*                QE_ERR_NULL_PTR
*                    Missing argument pointer.
*                QE_ERR_INVALID_ARG
*                    Unrecognized element id
*                QE_ERR_BUSY
*                    Cannot run function because another operation is in progress.
***********************************************************************************************************************/
qe_err_t R_CTSU_ReadSlider(sldr_ctrl_t *p_sldr_ctrl, uint16_t *p_buf1, uint16_t *p_buf2)
{
    qe_err_t  err;
    uint32_t    i;

#if (CTSU_CFG_PARAM_CHECKING_ENABLE)
    if ((NULL == p_sldr_ctrl)
     || (NULL == p_buf1)
     || ((NULL == p_buf2) && (CTSU_MODE_MUTUAL_FULL_SCAN == g_ctsu_ctrl.mode)))
    {
        return QE_ERR_NULL_PTR;
    }
#endif

    /* Load values from scan buffer */
    for (i=0; i < p_sldr_ctrl->num_elements; i++, p_buf1++, p_buf2++)
    {
        err = R_CTSU_ReadElement(p_sldr_ctrl->elem_index[i], p_buf1, p_buf2);
        if (QE_SUCCESS != err)
        {
            break;
        }
    }

    return err;

} /* End of function R_CTSU_ReadSlider() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_ReadElement
* Description  : This function returns the data scanned for the specified element/channel(s).
* Arguments    : element -
*                    Element associated with sensor/sensor pair (mutual)
*                p_value1 -
*                    Pointer to variable to load with primary value
*                p_value2 -
*                    Pointer to variable to load with secondary value
* Return Value : QE_SUCCESS
*                    Register value read
*                QE_ERR_INVALID_ARG
*                    Unrecognized element id
*                QE_ERR_NULL_PTR
*                    Missing argument pointer
*                QE_ERR_BUSY
*                    Cannot run function because another operation is in progress.
***********************************************************************************************************************/
qe_err_t R_CTSU_ReadElement(uint8_t element, uint16_t *p_value1, uint16_t *p_value2)
{
    qe_err_t err = QE_SUCCESS;
    uint16_t    i;

#if (CTSU_CFG_PARAM_CHECKING_ENABLE)
    if (element >= gp_cur_cfg->num_elements)
    {
        return QE_ERR_INVALID_ARG;
    }

    if ((NULL == p_value1)
     || ((NULL == p_value2) && (CTSU_MODE_MUTUAL_FULL_SCAN == g_ctsu_ctrl.mode)))
    {
        return QE_ERR_NULL_PTR;
    }
#endif

    /* Check if another API call is in progress */
    if (R_BSP_SoftwareLock(&g_ctsu_ctrl.lock) == false)
    {
        return QE_ERR_BUSY;
    }


    /* Get scan buffer index and fetch data value */
    i = (CTSU_MODE_MUTUAL_FULL_SCAN == g_ctsu_ctrl.mode) ? (element*4) : (element*2);

    *p_value1 = gp_cur_cfg->p_scan_buf[i];
    if (CTSU_MODE_MUTUAL_FULL_SCAN == g_ctsu_ctrl.mode)
    {
        *p_value2 = gp_cur_cfg->p_scan_buf[i+2];
    }


    R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);
    return err;

} /* End of function R_CTSU_ReadElement() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_ReadData
* Description  : This function gets the scan data (strips out reference data).
* Arguments    : p_buf
*                    Pointer to buffer to load scan data into
*                p_cnt
*                    Pointer to variable to load number of words placed into buffer
* Return Value : QE_SUCCESS
*                    Scan data read.
*                QE_ERR_NULL_PTR
*                    Missing argument pointer
*                QE_ERR_BUSY
*                    Cannot run function because another operation is in progress.
***********************************************************************************************************************/
qe_err_t R_CTSU_ReadData(uint16_t *p_buf, uint16_t *p_cnt)
{
    qe_err_t  err = QE_SUCCESS;
    uint16_t    *p_src;
    uint32_t    i;

#if (CTSU_CFG_PARAM_CHECKING_ENABLE)
    if ((NULL == p_buf) || (NULL == p_cnt))
    {
        return QE_ERR_NULL_PTR;
    }
#endif

    /* Check if another API call is in progress */
    if (R_BSP_SoftwareLock(&g_ctsu_ctrl.lock) == false)
    {
        return QE_ERR_BUSY;
    }


    /* Load count (excluding reference counter entries) */
    *p_cnt = (uint16_t) gp_cur_cfg->num_elements;
    if (CTSU_MODE_MUTUAL_FULL_SCAN == g_ctsu_ctrl.mode)
    {
        (*p_cnt) *= 2;
    }

    /* Load scan buffer data (excluding reference counter entries) */
    p_src = gp_cur_cfg->p_scan_buf;
    for (i=0; i < (*p_cnt); i++, p_buf++, p_src+=2)
    {
        *p_buf = *p_src;
    }

