NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);
    return err;

} /* End of function R_CTSU_ReadData() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_ReadReg
* Description  : This function returns the contents of the specified hardware register, except for the CTSUSSC, SO0, and
*                SO1 cases, where the configuration values assigned to those registers as per the specified key are read
*                instead.
* Arguments    : reg -
*                    ID for register to read
*                element -
*                    For CTSUSSC,SO0,SO1 only, element associated with sensor/sensor pair (mutual)
*                p_value -
*                    Pointer to variable to load with register value
* Return Value : QE_SUCCESS
*                    Register value read.
*                QE_ERR_NULL_PTR
*                    Missing argument pointer
*                QE_ERR_INVALID_ARG
*                    Unrecognized register or element id
*                QE_ERR_BUSY
*                    Cannot run function because another operation is in progress.
***********************************************************************************************************************/
qe_err_t R_CTSU_ReadReg(ctsu_reg_t reg, uint8_t element, uint16_t *p_value)
{
    qe_err_t err = QE_SUCCESS;

#if (CTSU_CFG_PARAM_CHECKING_ENABLE)
    if ((reg >= CTSU_REG_END_ENUM) || (element >= gp_cur_cfg->num_elements))
    {
        return QE_ERR_INVALID_ARG;
    }

    if (NULL == p_value)
    {
        return QE_ERR_NULL_PTR;
    }
#endif

    /* Check if another API call is in progress */
    if (R_BSP_SoftwareLock(&g_ctsu_ctrl.lock) == false)
    {
        return QE_ERR_BUSY;
    }


    /* Read register value */
    switch (reg)
    {
        case CTSU_REG_CR0:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCR0.BYTE;
            break;
        }
        case CTSU_REG_CR1:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCR1.BYTE;
            break;
        }
        case CTSU_REG_SDPRS:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUSDPRS.BYTE;
            break;
        }
        case CTSU_REG_MCH0:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUMCH0.BYTE;
            break;
        }
        case CTSU_REG_MCH1:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUMCH1.BYTE;
            break;
        }
        case CTSU_REG_CHAC0:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHAC0.BYTE;
            break;
        }
        case CTSU_REG_CHAC1:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHAC1.BYTE;
            break;
        }
#if (CTSU_HAS_LARGE_REG_SET)
        case CTSU_REG_CHAC2:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHAC2.BYTE;
            break;
        }
        case CTSU_REG_CHAC3:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHAC3.BYTE;
            break;
        }
        case CTSU_REG_CHAC4:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHAC4.BYTE;
            break;
        }
#endif

        case CTSU_REG_CHTRC0:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHTRC0.BYTE;
            break;
        }
        case CTSU_REG_CHTRC1:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHTRC1.BYTE;
            break;
        }
#if (CTSU_HAS_LARGE_REG_SET)
        case CTSU_REG_CHTRC2:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHTRC2.BYTE;
            break;
        }
        case CTSU_REG_CHTRC3:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHTRC3.BYTE;
            break;
        }
        case CTSU_REG_CHTRC4:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUCHTRC4.BYTE;
            break;
        }
#endif

        case CTSU_REG_ST:
        {
            /* cast byte register to word argument */
            *p_value = (uint16_t) CTSU.CTSUST.BYTE;
            break;
        }
        case CTSU_REG_SSC:
        {
            *p_value = gp_cur_cfg->p_elem_regs[element].ctsussc;
            break;
        }
        case CTSU_REG_SO0:
        {
            *p_value = gp_cur_cfg->p_elem_regs[element].ctsuso0;
            break;
        }
        case CTSU_REG_SO1:
        {
            *p_value = gp_cur_cfg->p_elem_regs[element].ctsuso1;
            break;
        }
        case CTSU_REG_SC:
        {
            *p_value = CTSU.CTSUSC.WORD;
            break;
        }
        case CTSU_REG_RC:
        {
            *p_value = CTSU.CTSURC.WORD;
            break;
        }
        case CTSU_REG_ERRS:
        {
            *p_value = CTSU.CTSUERRS.WORD;
            break;
        }
        default:
        {
            err = QE_ERR_INVALID_ARG;
            break;
        }
    }

    R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);
    return err;

} /* End of function R_CTSU_ReadReg() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_WriteReg
* Description  : This function writes the passed in value to the specified hardware register, except for the CTSUSSC,
*                SO0, and SO1 cases, where the value is written to the configuration variables associated with the
*                specified key instead.
* Arguments    : reg -
*                    ID for register to read
*                element -
*                    For CTSUSSC,SO0,SO1 only, element associated with sensor/sensor pair (mutual)
*                value -
*                    Value to write to register
* Return Value : QE_SUCCESS
*                    Register value written.
*                QE_CTSU_INVALID_ARG
*                    Unsupported register, or unrecognized register or key id.
*                QE_ERR_BUSY
*                    Cannot run function because another operation is in progress.
***********************************************************************************************************************/
qe_err_t R_CTSU_WriteReg(ctsu_reg_t reg, uint8_t element, uint16_t value)
{
    /* cast argument to byte for 8-bit registers */
    uint8_t   byte_value = (uint8_t) value;
    qe_err_t  err = QE_SUCCESS;

#if (CTSU_CFG_PARAM_CHECKING_ENABLE)
    if ((CTSU_REG_MCH1 == reg)
     || ((CTSU_REG_MCH0 == reg) && (CTSU_MODE_SELF_SINGLE_SCAN != g_ctsu_ctrl.mode))
     || (reg >= CTSU_REG_END_ENUM)
     || (element >= gp_cur_cfg->num_elements))
    {
        return QE_ERR_INVALID_ARG;
    }
#endif

    /* Check if another API call is in progress */
    if (R_BSP_SoftwareLock(&g_ctsu_ctrl.lock) == false)
    {
        return QE_ERR_BUSY;
    }


