NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    /* Write register value */
    switch (reg)
    {
        case CTSU_REG_CR0:
        {
            CTSU.CTSUCR0.BYTE = byte_value;
            break;
        }
        case CTSU_REG_CR1:
        {
            CTSU.CTSUCR1.BYTE = byte_value;
            break;
        }
        case CTSU_REG_SDPRS:
        {
            CTSU.CTSUSDPRS.BYTE = byte_value;
            break;
        }
        case CTSU_REG_MCH0:
        {
            CTSU.CTSUMCH0.BYTE = byte_value;       // user may need to set CTSUINIT afterwards
            break;
        }
        case CTSU_REG_CHAC0:
        {
            CTSU.CTSUCHAC0.BYTE = byte_value;
            break;
        }
        case CTSU_REG_CHAC1:
        {
            CTSU.CTSUCHAC1.BYTE = byte_value;
            break;
        }
#if (CTSU_HAS_LARGE_REG_SET)
        case CTSU_REG_CHAC2:
        {
            CTSU.CTSUCHAC2.BYTE = byte_value;
            break;
        }
        case CTSU_REG_CHAC3:
        {
            CTSU.CTSUCHAC3.BYTE = byte_value;
            break;
        }
        case CTSU_REG_CHAC4:
        {
            CTSU.CTSUCHAC4.BYTE = byte_value;
            break;
        }
#endif
        case CTSU_REG_CHTRC0:
        {
            CTSU.CTSUCHTRC0.BYTE = byte_value;
            break;
        }
        case CTSU_REG_CHTRC1:
        {
            CTSU.CTSUCHTRC1.BYTE = byte_value;
            break;
        }
#if (CTSU_HAS_LARGE_REG_SET)
        case CTSU_REG_CHTRC2:
        {
            CTSU.CTSUCHTRC2.BYTE = byte_value;
            break;
        }
        case CTSU_REG_CHTRC3:
        {
            CTSU.CTSUCHTRC3.BYTE = byte_value;
            break;
        }
        case CTSU_REG_CHTRC4:
        {
            CTSU.CTSUCHTRC4.BYTE = byte_value;
            break;
        }
#endif
        case CTSU_REG_ST:
        {
            CTSU.CTSUST.BYTE = byte_value;         // user may need to set CTSUINIT afterwards
            break;
        }
        case CTSU_REG_SSC:
        {
            gp_cur_cfg->p_elem_regs[element].ctsussc = value;
            break;
        }
        case CTSU_REG_SO0:
        {
            gp_cur_cfg->p_elem_regs[element].ctsuso0 = value;
            break;
        }
        case CTSU_REG_SO1:
        {
            gp_cur_cfg->p_elem_regs[element].ctsuso1 = value;
            break;
        }
#ifdef BSP_MCU_RX23_ALL
        case CTSU_REG_SC:
        {
            CTSU.CTSUSC.WORD = value;                   // user may need to set CTSUINIT afterwards
            break;
        }
        case CTSU_REG_RC:
        {
            CTSU.CTSURC.WORD = value;                   // user may need to set CTSUINIT afterwards
            break;
        }
#endif
        case CTSU_REG_ERRS:
        {
            CTSU.CTSUERRS.WORD = value;
            break;
        }
        default:
        {
            err = QE_ERR_INVALID_ARG;
            break;
        }
    }

    R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);
    return err;

} /* End of function R_CTSU_WriteReg() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: r_ctsu_control_private
* Description  : This function processes driver special-operation commands for Touch layer interface only.
*                This should not be exposed to the user.
* Arguments    : pcmd -
*                    Private command to perform.
*                method -
*                    Method to perform command on. Typically QE_CUR_METHOD.
*                p_arg -
*                    Pointer to arguments specific to the command. Can be NULL.
* Return Value : QE_SUCCESS -
*                    Command completed successfully
*                QE_ERR_INVALID_ARG -
*                    Command or method unknown.
*                QE_ERR_NULL_PTR -
*                    Missing argument (p_arg).
***********************************************************************************************************************/
qe_err_t r_ctsu_control_private(ctsu_pcmd_t pcmd, uint8_t method, void *p_arg)
{
    qe_err_t        err=QE_SUCCESS;

    /* FUTURE CMD: may require software lock */


    if (QE_CUR_METHOD == method)
    {
        method = g_ctsu_ctrl.cur_method;
    }


    switch (pcmd)
    {
        case CTSU_PCMD_DISABLE_CTSU_INTS:
        {
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
            IEN(CTSU,CTSUWR)= 0;
            IEN(CTSU,CTSURD)= 0;
            IEN(CTSU,CTSUFN)= 0;
#else
            R_BSP_InterruptRequestDisable(VECT(CTSU,CTSUWR));
            R_BSP_InterruptRequestDisable(VECT(CTSU,CTSURD));
            R_BSP_InterruptRequestDisable(VECT(CTSU,CTSUFN));
#endif
            break;
        }
        case CTSU_PCMD_ENABLE_CTSU_INTS:
        {
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
            IEN(CTSU,CTSUWR)= 1;
            IEN(CTSU,CTSURD)= 1;
            IEN(CTSU,CTSUFN)= 1;
#else
            R_BSP_InterruptRequestEnable(VECT(CTSU,CTSUWR));
            R_BSP_InterruptRequestEnable(VECT(CTSU,CTSURD));
            R_BSP_InterruptRequestEnable(VECT(CTSU,CTSUFN));
#endif
            break;
        }
        case CTSU_PCMD_SET_OFFSET_TUNING_FLG:
        {
            g_ctsu_ctrl.p_methods[method]->ctsu_status.flag.offset_tuning = 1;  // do not allow scan-done callback
            CTSU.CTSUCR0.BIT.CTSUCAP = 0;                                       // configure for software triggering
            break;
        }
        case CTSU_PCMD_CLR_OFFSET_TUNING_FLG:
        {
            if (QE_TRIG_EXTERNAL == g_ctsu_ctrl.trigger)    // restore external trigger operation if was configured
            {
                CTSU.CTSUCR0.BIT.CTSUCAP = 1;               // specify external trigger usage
                CTSU.CTSUCR0.BIT.CTSUSTRT = 1;              // arm external trigger detect
            }
            g_ctsu_ctrl.p_methods[method]->ctsu_status.flag.offset_tuning = 0;

            break;
        }
        default:
        {
            err = QE_ERR_INVALID_ARG;
        }
    }

