NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    return err;
} /* End of function r_ctsu_control_private() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_Control
* Description  : This function processes driver special-operation commands.
* Arguments    : cmd -
*                    Command to perform.
*                method -
*                    Method to perform command on. Typically QE_CUR_METHOD.
*                p_arg -
*                    Pointer to arguments specific to the command.
*                    CTSU_CMD_SET_CALLBACK          void (*)(ctsu_isr_evt_t, void *)
*                    CTSU_CMD_GET_STATE             ctsu_state_t *
*                    CTSU_CMD_GET_STATUS            ctsu_status_t *
*                    CTSU_CMD_SET_METHOD            NULL
*                    CTSU_CMD_GET_METHOD_MODE       ctsu_mode_t *
*                    CTSU_CMD_GET_SCAN_INFO         scan_info_t *
*                    CTSU_CMD_SNOOZE_ENABLE         NULL
*                    CTSU_CMD_SNOZZE_DISABLE        NULL
*
* Return Value : QE_SUCCESS -
*                    Command completed successfully
*                QE_ERR_INVALID_ARG -
*                    Command or method unknown.
*                QE_ERR_NULL_PTR -
*                    Missing argument (p_arg).
***********************************************************************************************************************/
qe_err_t R_CTSU_Control(ctsu_cmd_t cmd, uint8_t method, void *p_arg)
{
    qe_err_t        err=QE_SUCCESS;
    uint8_t         byte;
    bool            do_unlock = false;
    ctsu_mode_t     *p_mode=(ctsu_mode_t *)p_arg;
    ctsu_status_t   *p_status=(ctsu_status_t *)p_arg;
    ctsu_state_t    *p_state=(ctsu_state_t *)p_arg;
    scan_info_t     *p_scan_info=(scan_info_t *)p_arg;


#if (CTSU_CFG_PARAM_CHECKING_ENABLE)
    if (cmd >= CTSU_CMD_END_ENUM)
    {
        return QE_ERR_INVALID_ARG;      // command out of range
    }

    if (((CTSU_CMD_SET_CALLBACK != cmd) && (CTSU_CMD_GET_STATE != cmd) &&
         (CTSU_CMD_SNOOZE_ENABLE != cmd) && (CTSU_CMD_SNOOZE_DISABLE != cmd))
      && ((method >= g_ctsu_ctrl.num_methods) && (QE_CUR_METHOD != method)))
    {
        return QE_ERR_INVALID_ARG;      // method out of range
    }

    if (((CTSU_CMD_GET_STATE == cmd) || (CTSU_CMD_GET_STATUS == cmd)
     || (CTSU_CMD_SET_CALLBACK == cmd) || (CTSU_CMD_GET_SCAN_INFO == cmd))
     && (NULL == p_arg))
    {
        return QE_ERR_NULL_PTR;         // missing p_arg argument
    }
#endif

    /* if not a Get command */
    if ((CTSU_CMD_GET_STATE != cmd) && (CTSU_CMD_GET_STATUS != cmd) && (CTSU_CMD_GET_SCAN_INFO != cmd))
    {
        /* Check if another API call is in progress/get lock */
        if (R_BSP_SoftwareLock(&g_ctsu_ctrl.lock) == false)
        {
            return QE_ERR_BUSY;         // failed to get lock
        }
        else
        {
            do_unlock = true;           // got lock; set flag to unlock driver after command processed
        }
    }

    if (QE_CUR_METHOD == method)
    {
        method = g_ctsu_ctrl.cur_method;
    }

    switch (cmd)
    {
        /* Method independent commands */

        case CTSU_CMD_SET_CALLBACK:
        {
            /* cast argument to function prototype */
            g_ctsu_ctrl.p_callback = (void (*)(ctsu_isr_evt_t, void *))p_arg;
            break;
        }
        case CTSU_CMD_GET_STATE:
        {
            *p_state = g_ctsu_ctrl.state;
            break;
        }

        /* Method dependent commands */

        case CTSU_CMD_GET_STATUS:
        {
            *p_status = g_ctsu_ctrl.p_methods[method]->ctsu_status;
            break;
        }
        case CTSU_CMD_SET_METHOD:
        {
            init_method(method);
            break;
        }
        case CTSU_CMD_GET_METHOD_MODE:
        {
            byte = gp_ctsu_cfgs[method]->ctsucr1;

            /* get CTSU.CTSUCR1.BIT.CTSUMD (bits 6 and 7) */
            *p_mode = (ctsu_mode_t) (byte >> 6);
            break;
        }
        case CTSU_CMD_GET_SCAN_INFO:
        {
            *p_scan_info = g_pvt_scan_info[method];       // structure value assignment
            break;
        }
        case CTSU_CMD_SNOOZE_ENABLE:
        {
#if BSP_MCU_SERIES_RX100
            CTSU.CTSUCR0.BIT.CTSUSNZ = 1;
#else
            err = QE_ERR_INVALID_ARG;                     // snooze unavailable on RX231/23W
#endif
            break;
        }
        case CTSU_CMD_SNOOZE_DISABLE:
        {
#if BSP_MCU_SERIES_RX100
            CTSU.CTSUCR0.BIT.CTSUSNZ = 0;
            R_BSP_SoftwareDelay(16, BSP_DELAY_MICROSECS); // wait for CTSU "wake up"; REQUIRED BY HARDWARE!
#else
            err = QE_ERR_INVALID_ARG;                     // snooze unavailable on RX231/23W
#endif
            break;
        }
        default:
        {
            err = QE_ERR_INVALID_ARG;
        }
    }

    if (true == do_unlock)
    {
        R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);
    }

    return err;

} /* End of function R_CTSU_Control() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_Close
* Description  : This function shuts down the CTSU peripheral.
* Arguments    : None
* Return Value : QE_SUCCESS -
*                    Peripheral shut down successfully.
*                QE_ERR_BUSY
*                    Cannot run function because another operation is in progress.
***********************************************************************************************************************/
qe_err_t R_CTSU_Close(void)
{
    qe_err_t err = QE_SUCCESS;


    /* Check if another API call is in progress */
    if (R_BSP_SoftwareLock(&g_ctsu_ctrl.lock) == false)
    {
        return QE_ERR_BUSY;
    }

    /* Disable interrupts for write, read, & scan done */
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
    IEN(CTSU,CTSUWR)= 0;
    IEN(CTSU,CTSURD)= 0;
    IEN(CTSU,CTSUFN)= 0;
#else
    R_BSP_InterruptRequestDisable(VECT(CTSU,CTSUWR));
    R_BSP_InterruptRequestDisable(VECT(CTSU,CTSURD));
    R_BSP_InterruptRequestDisable(VECT(CTSU,CTSUFN));
#endif


