NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    /* Turn off power and capacitance switch */
    CTSU.CTSUCR1.BIT.CTSUPON = 0;
    CTSU.CTSUCR1.BIT.CTSUCSW = 0;

    /* Put CTSU peripheral into stop state (stop power/clock) */
    R_BSP_RegisterProtectDisable (BSP_REG_PROTECT_LPC_CGC_SWR);
    MSTP(CTSU) = 1;
    R_BSP_RegisterProtectEnable (BSP_REG_PROTECT_LPC_CGC_SWR);

    g_ctsu_ctrl.open = false;
    R_BSP_SoftwareUnlock(&g_ctsu_ctrl.lock);
    return err;

} /* End of function R_CTSU_Close() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_CTSU_GetVersion
* Description  : Returns the current version of this module. The version number is encoded where the top 2 bytes are the
*                major version number and the bottom 2 bytes are the minor version number. For example, Version 4.25
*                would be returned as 0x00040019.
* Arguments    : none
* Return Value : Version of this module.
***********************************************************************************************************************/
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
#pragma inline(R_CTSU_GetVersion)
#else
R_BSP_PRAGMA_INLINE(R_CTSU_GetVersion)
#endif

uint32_t R_CTSU_GetVersion (void)
{
    /* These version macros are defined in r_ctsu_rx_if.h. */
    return ((((uint32_t)QECTSU_RX_VERSION_MAJOR) << 16) | (uint32_t)QECTSU_RX_VERSION_MINOR);
} /* End of function R_CTSU_GetVersion() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE_END
#endif

